

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include "codec_typedefine.h"
#include "codec_com_codec.h"
#include "efr_cnst.h"

#ifndef __EFR_INTERFACE_H__
#define __EFR_INTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define EFR_CODED_BITS_LENGTH           (244)                                   /*EFR编码器编码比特提取结果,57个参数提取共244比特*/
#define ERF_CODED_PRMS_LENGTH           (57)                                    /*EFR码流参数个数*/
#define EFR_HOMING_WHOLE_FRAME          (57)                                    /*EFR下行全帧HOMING检测参数个数*/
#define EFR_HOMING_FIRST_SUBFRAME       (18)                                    /*EFR下行第一子帧HOMING检测参数个数*/

#define EFR_GetDtxFlagPtr()             (&efr_dtx_mode)                         /*获取全局变量EFR的DTX模式变量指针*/

#define EFR_GetOldResetPtr()            (&g_shwEfrOldResetFlag)                 /*获取全局变量EFR上一帧reset标志指针*/

#define EFR_GetNewSpeechPtr()           (efr_new_speech)                        /*获取全局变量EFR编码输入序列指针*/

#define EFR_GetTxDtxCtrl()              (efr_txdtx_ctrl)                        /*获取全局变量EFR上行DTX控制字*/

#define EFR_GetSynthBufPtr()            (efr_synth_buf)                         /*获取全局变量EFR解码输入序列指针*/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/
/*****************************************************************************
 实体名称  : EFR_DECODE_FRAME_STRU
 功能描述  : EFR送入解码器前码流格式结构体
*****************************************************************************/
typedef struct
{
    CODEC_BFI_ENUM_UINT16           enBfiFlag;                              /* BFI标志 */
    VOS_INT16                           ashwSerial[ERF_CODED_PRMS_LENGTH];      /* EFR解码参数流 */
}EFR_DECODE_FRAME_STRU;

/*****************************************************************************
  7 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  9 全局变量声明
*****************************************************************************/
extern VOS_INT16    efr_txdtx_ctrl;                                                 /*声明:协议代码全局变量DTX上行控制字*/
extern VOS_INT16   *efr_new_speech;                                                 /*声明:协议代码全局变量编码输入序列指针*/

extern VOS_INT16    efr_dtx_mode;                                                   /*声明:协议代码全局变量DTX模式标志*/
extern VOS_INT16    efr_synth_buf[CODEC_FRAME_LENGTH_NB + EFR_M];                                 /*声明:协议代码全局变量语音编码缓存*/

/*****************************************************************************
  10 函数声明
*****************************************************************************/








#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif /* end of efr_interface.h */
