/*************************************************************************
*   版权所有(C) 1987-2004, 深圳华为技术有限公司.
*
*   文 件 名 :  dload_show.h
*
*   作    者 :  wuzechun
*
*   描    述 :  dload_show.cpp 的头文件
*
*   修改记录 :  2012年12月19日  v1.00  wuzechun  创建
*
*************************************************************************/

#ifndef __DLOAD_SHOW_H__
#define __DLOAD_SHOW_H__

/*--------------------------------------------------------------*
 * 宏定义                                                       *
 *--------------------------------------------------------------*/

/*--------------------------------------------------------------*
 * 数据结构                                                     *
 *--------------------------------------------------------------*/

/* 升级状态 */
enum dload_status
{
    DLOAD_STATE_IDLE,           /* 尚未升级 */
    DLOAD_STATE_USB_RUNNING,    /* USB升级中 */
    DLOAD_STATE_TF_RUNNING,    /* TF升级中 */
    DLOAD_STATE_SUCCESS,        /* 升级成功 */
    DLOAD_STATE_FAILED,         /* 升级失败 */
    DLOAD_STATE_MAX
};

/*--------------------------------------------------------------*
 * 函数原型声明                                                 *
 *--------------------------------------------------------------*/

extern void state_show(enum dload_status state );
#endif /* dload_show.h */

