#include "dload_show.h"

/*****************************************************************************
* 函 数 名  : state_show
*
* 功能描述  : 显示升级状态
*
* 输入参数  : 
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
void state_show(enum dload_status state )
{
    
}


/*****************************************************************************
* 函 数 名  : state_show_lcd
*
* 功能描述  : LCD显示
*
* 输入参数  : 
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
void state_show_lcd(enum dload_status state )
{
    
}

/*****************************************************************************
* 函 数 名  : state_show_led
*
* 功能描述  : LED显示升级状态
*
* 输入参数  : 
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
void state_show_led(enum dload_status state )
{
    
}

