/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : fr_codec.h
  版 本 号   : 初稿
  作    者   : 谢明辉 58441
  生成日期   : 2011年8月15日
  最近修改   :
  功能描述   : FR编解码数据类型及结构体定义头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年8月15日
    作    者   : 谢明辉 58441
    修改内容   : 创建文件

******************************************************************************/

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#ifndef __FR_CODEC_H__
#define __FR_CODEC_H__

#include "codec_op_etsi.h"
#include "codec_op_vec.h"
#include "fr_dtx.h"
#include "fr_vad.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define MIN_WORD                        (-32768)
#define MAX_WORD                        (32767)
#define MAX_LONGWORD                    (2147483647)

#ifdef  SASR        /* flag: >> is a signed arithmetic shift right */
#undef  SASR
#define SASR(x, by)    ((x) >> (by))
#else
#define SASR(x, by)    ((x) >= 0 ? (x) >> (by) : (~(-((x) + 1) >> (by))))
#endif    /* SASR */

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/

/************************************************************************
实体名称: FR_RPELTP_STATE_STRU
功能描述: FR声码器RPE-LTP编解码主体结构体，编码和解码共用
************************************************************************/
typedef struct
{
    Word16                              dp0[ 280 ];
    Word32                              L_z2;                                   /*Offset_com. */
    Word16                              z1;                                     /* preprocessing.c, Offset_com. */
    Word16                              mp;                                     /* Preemphasis */
    Word16                              u[8];                                   /* short_term_aly_filter.c      */
    Word16                              LARpp[2][8];
    Word16                              j;
    Word16                              nrp;                                    /* long_term.c, synthesis       */
    Word16                              v[9];                                   /* short_term.c, synthesis      */
    Word16                              msr;                                    /* decoder.c,   Postprocessing  */
    Word8                               verbose;                                /* only used if !NDEBUG     */
    Word8                               fast;                                   /* only used if FAST        */
    UWord16                             uhwRsv;
}FR_RPELTP_STATE_STRU;

/************************************************************************
实体名称: FR_ENCODE_STATE_STRU
功能描述: FR编码主体结构体
************************************************************************/
typedef struct
{
    FR_RPELTP_STATE_STRU                stRpeLtpState;                          /* RPE-LTP编码使用参数 */
    FR_VAD_STATE_STRU                   stVadState;                             /* VAD检测主结构体 */
    FR_ENC_DTX_STATE_STRU               stEncDtxState;                          /* DTX控制及舒适噪声估计主结构体 */
    FR_DTX_ENUM_UINT16                  enDtxFlag;                              /* DTX使能标志 */
    UWord16                             uhwRsv;
}FR_ENCODE_STATE_STRU;

/************************************************************************
实体名称: FR_DECODE_STATE_STRU
功能描述: FR解码主体结构体
************************************************************************/
typedef struct
{
    FR_RPELTP_STATE_STRU                stRpeLtpState;                          /* RPE-LTP解码使用参数 */
    FR_DEC_DTX_STATE_STRU               stDecDtxState;                          /*DTX下行控制、舒适噪声产生及丢失帧恢复主体结构体*/
}FR_DECODE_STATE_STRU;

/*****************************************************************************
  7 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  9 全局变量声明
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

#ifdef __cplusplus
#if __cplusplus
    }
#endif
#endif

#endif /* end of fr_codec.h */
