

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#ifndef __AMR_INTERFACE_H__
#define __AMR_INTERFACE_H__

#include "codec_typedefine.h"
#include "codec_com_codec.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define AMR_MAX_SERIAL_SIZE             (244)                                   /*编码后AMR码流的最大长度，以bit为单位*/

#define AMR_GetSidFirstFlag()           (g_uhwAmrSidFirstFlag)                  /*获取全局变量AMR一次通话过程中是否收到过SID_FIRST帧标志*/
#define AMR_GetSidFirstFlagPtr()        (&g_uhwAmrSidFirstFlag)                 /*获取全局变量AMR一次通话过程中是否收到过SID_FIRST帧标志指针*/
#define AMR_GetEncObjPtr()              (g_pstAmrEncObj)                        /*获取全局变量AMR编码状态结构体指针*/
#define AMR_GetDecObjPtr()              (g_pstAmrDecObj)                        /*获取全局变量AMR解码状态结构体指针*/
#define AMR_GetPtrOfEncObjPtr()         (&g_pstAmrEncObj)                       /*获取全局变量AMR编码状态结构体指针的指针*/
#define AMR_GetPtrOfDecObjPtr()         (&g_pstAmrDecObj)                       /*获取全局变量AMR解码状态结构体指针的指针*/

/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/
/*****************************************************************************
 实体名称  : AMR_ENCODED_SERIAL_STRU
 功能描述  : 声码器编码结果序列结构体
*****************************************************************************/
typedef struct
{
    VOS_UINT16                          uhwFrameType;                           /* 编码帧类型 */
    VOS_INT16                           ashwEncSerial[AMR_MAX_SERIAL_SIZE];     /* 编码结果比特流,12.2K时最大，为244比特 */
    CODEC_AMR_MODE_ENUM_UINT16      enAmrMode;                              /* 当前速率，AMR-NB下0-7(SPEECH)或-1(NO_DATA) */
    VOS_INT16                           ashwReserved[4];                        /* 保留，未使用 */
}AMR_ENCODED_SERIAL_STRU;

/*****************************************************************************
 实体名称  : AMR_ENCODED_SID_FRAME_STRU
 功能描述  : AMR SID帧格式结构体
*****************************************************************************/
typedef struct
{
    VOS_INT16                           ashwSidData1[2];                        /*SID帧数据,共35比特(32+3)*/
    VOS_UINT16                          shwUndefined:1;
    VOS_UINT16                          shwModeIndication:3;                    /*速率模式指示，0-8*/
    VOS_UINT16                          shwSti:1;                               /*SID标志，0表示SID_FIRST，1表示SID_UPDATE*/
    VOS_UINT16                          shwSidData2:3;                          /*SID帧数据,共35比特(32+3)*/
    VOS_INT16                           shwReserved;                            /*  */
}AMR_ENCODED_SID_FRAME_STRU;

/*****************************************************************************
  7 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  9 全局变量声明
*****************************************************************************/
extern VOS_UINT16                       g_uhwAmrSidFirstFlag;                   /*一次通话中收到过SID_FIRST桢的标记*/


/*****************************************************************************
  10 函数声明
*****************************************************************************/





#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif /* end of amr_interface.h */
