/*************************************************************************
*   版权所有(C) 1987-2011, 深圳华为技术有限公司.
*
*   文 件 名 :  drv_int.h
*
*   作    者 :  lixiaojie
*
*   修改记录 :  2013年7月12日  v1.00  lixiaojie创建
*************************************************************************/

#ifndef __DRV_INT_H__
#define __DRV_INT_H__
#include "drv_comm.h"

/*************************INT BEGIN***********************************/

/*****************************************************************************
 * 函 数 名  : VOS_CheckInterrupt
 *
 * 功能描述  : C CORE 检测是否为中断上下文
 *
 * 输入参数  : 无

 * 输出参数  : 无
 *
 * 返 回 值  : 非0   处于中断上下文
                 0    处于进程上下文，非中断上下文

 *****************************************************************************/
unsigned int DRV_INT_GET_CONTEXT(BSP_VOID);


/*****************************************************************************
 函 数 名  : BSP_SendNMIInterrupt
 功能描述  : 发送一个NMI中断
 输入参数  : NMI中断Bit位
 输出参数  : 无
 返回值    ：无
*****************************************************************************/
static INLINE BSP_VOID DRV_SEND_NMI_INT(unsigned int SocBitNO, unsigned int ZspBitNO)
{
    /* 李晓杰、李霄、翁建红确认已经不再需要，直接打桩 */
    return;
}
/*****************************************************************************
 函 数 名  : BSP_INT_Connect
 功能描述  : 往中断上挂接中断处理函数
 输入参数  : vector中断号，
                           routine中断服务程序
                           parameter中断服务程序参数
 输出参数  : 无
 返回值    ：0成功
                           -1 失败
*****************************************************************************/

BSP_S32 BSP_INT_Connect(VOIDFUNCPTR * vector,VOIDFUNCPTR routine, BSP_S32 parameter);
/*****************************************************************************
 函 数 名  : BSP_INT_Disable
 功能描述  : 禁止中断
 输入参数  : s32Lvl要禁止的中断号
 输出参数  : 无
 返回值    ：0成功
                           -1 失败
*****************************************************************************/

BSP_S32 BSP_INT_Disable (BSP_S32 s32Lvl);
/*****************************************************************************
 函 数 名  : BSP_INT_Enable
 功能描述  : 使能中断
 输入参数  : s32Lvl要使能的中断号
 输出参数  : 无
 返回值    ：0成功
                           -1 失败
*****************************************************************************/

BSP_S32 BSP_INT_Enable ( BSP_S32 s32Lvl);

/*************************INT END*************************************/


#endif

