

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#ifndef __UCOM_CONFIG_H__
#define __UCOM_CONFIG_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  2 宏定义
*****************************************************************************/

/* 平台类型定义 */

/*****************************************************************************
  3 编译开关定义
*****************************************************************************/

/* 硬件平台编译开关配置 */


/* SOUND功能配置 */

/* ERRORLOG功能配置 */
#ifndef _MED_ERRORLOG
#define _MED_ERRORLOG
#endif

/* 内存操作使用库函数 */
#ifndef _UCOM_USE_STD_LIB
#define _UCOM_USE_STD_LIB
#endif

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif /* end of ucom_config.h */

