

#ifndef __RRMTIMER_H__
#define __RRMTIMER_H__


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)


#if (FEATURE_ON == FEATURE_DSDS)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
/* RRM默认定时器时长，单位毫秒，当前为50ms */
#define RRM_TMR_DEF_LEN                     (50)



/*****************************************************************************
  3 枚举定义
*****************************************************************************/


enum RRM_RFID_ENUM
{
    RRM_RFID_0               = 0,   /* RFID 0 标识 */
    RRM_RFID_1               = 1,   /* RFID 1 标识 */
    RRM_RFID_2               = 2,   /* RFID 2 标识 */
    RRM_RFID_BUTT
};
typedef VOS_UINT16 RRM_RFID_ENUM_UINT16;
enum RRM_TIMER_ENUM
{
    RRM_TIMER_0               = 0,   /* TIMER 0 标识 */
    RRM_TIMER_1               = 1,   /* TIMER 1 标识 */
    RRM_TIMER_2               = 2,   /* TIMER 2 标识 */
    RRM_TIMER_BUTT
};
typedef VOS_UINT16 RRM_TIMER_ENUM_UINT16;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/
/*lint -e958 原因简述：定时器消息，暂无法修改消息结构 */
typedef struct
{
   VOS_UINT8                            ucType;
   VOS_UINT8                            ucValid;
   VOS_UINT16                           usRsv;
   RRM_TIMER_ENUM_UINT16                enName;
   VOS_UINT32                           ulPara;
   VOS_UINT32                           pNext;
   VOS_UINT32                           pPrev;
   VOS_UINT8                            aucData[24];
}RRM_TIMER_MSG_DATA;
/*_H2ASN_Length UINT32*/
/*lint +e958 原因简述：定时器消息，暂无法修改消息结构 */

/*用于ASN.1解析头*/

typedef struct
{
    VOS_MSG_HEADER
    RRM_TIMER_MSG_DATA   stMsgData;
}RrmTimer_MSG;


/*****************************************************************************
  8 UNION定义
*****************************************************************************/

/*****************************************************************************
 结构名    : RRM_TIMER_CTRL_STRU
 协议表格  :
 ASN.1描述 :
 结构说明  : RRM 定时器结构
*****************************************************************************/
typedef struct
{
    HTIMER                              pstStaTHandle;      /* 定时器句柄 */
    RRM_RFID_ENUM_UINT16                enRFIDTimerId;      /* 定时器标识 */
    VOS_UINT8                           aucReserved[2];
}RRM_RFID_TIMER_CTRL_STRU;



/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

extern VOS_UINT32 RRM_StartTimer
(
    RRM_RFID_ENUM_UINT16                enRFIDTimerId
);

extern VOS_UINT32 RRM_StopTimer
(
    RRM_RFID_ENUM_UINT16                enRFIDTimerId
);


#endif /* FEATURE_ON == FEATURE_DSDS */


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of RrmTimer.h */

