/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : amrwb_interface.h
  版 本 号   : 初稿
  作    者   : 谢明辉 58441
  生成日期   : 2011年11月23日
  最近修改   :
  功能描述   : amrwb_interface.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年11月23日
    作    者   : 谢明辉 58441
    修改内容   : 创建文件

******************************************************************************/

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#ifndef __AMRWB_INTERFACE_H__
#define __AMRWB_INTERFACE_H__

#include "codec_typedefine.h"
#include "codec_com_codec.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define AMRWB_MAX_SERIAL_SIZE           (477)                                   /*编码后AMR码流的最大长度，以bit为单位*/
#define AMRWB_SID_FIRST_STUDY_FRM_THD   (9)                                     /*SID_FIRST在声码器重启后需要学习的最少帧数*/

#define AMRWB_GetSidFirstFlag()         (g_uhwAmrwbSidFirstFlag)                /*获取全局变量AMR一次通话过程中是否收到过SID_FIRST帧标志*/
#define AMRWB_GetSidFirstFlagPtr()      (&g_uhwAmrwbSidFirstFlag)               /*获取全局变量AMR一次通话过程中是否收到过SID_FIRST帧标志指针*/
#define AMRWB_GetEncObjPtr()            (g_pstAmrwbEncObj)                      /*获取全局变量AMR编码状态结构体指针*/
#define AMRWB_GetDecObjPtr()            (g_pstAmrwbDecObj)                      /*获取全局变量AMR解码状态结构体指针*/
#define AMRWB_GetPtrOfEncObjPtr()       (&g_pstAmrwbEncObj)                     /*获取全局变量AMR编码状态结构体指针的指针*/
#define AMRWB_GetPtrOfDecObjPtr()       (&g_pstAmrwbDecObj)                     /*获取全局变量AMR解码状态结构体指针的指针*/

/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/
/*****************************************************************************
 实体名称  : AMRWB_ENCODED_SERIAL_STRU
 功能描述  : 声码器编码结果序列结构体
*****************************************************************************/
typedef struct
{
    VOS_UINT16                          uhwFrameType;                           /* 编码帧类型 */
    VOS_INT16                           ashwEncSerial[AMRWB_MAX_SERIAL_SIZE];   /* 编码结果比特流,23.85K时最大，为477比特 */
    CODEC_AMRWB_MODE_ENUM_UINT16    enAmrMode;                              /* 当前速率，AMR-WB下0-8(SPEECH)或9(NO_DATA) */
    VOS_INT16                           ashwReserved[3];                        /* 保留，未使用 */
}AMRWB_ENCODED_SERIAL_STRU;

/*****************************************************************************
 实体名称  : AMRWB_ENCODED_SID_FRAME_STRU
 功能描述  : AMR SID帧格式结构体
*****************************************************************************/
typedef struct
{
    VOS_INT16                           ashwSidData1[2];                        /*SID帧数据,共35比特(32+3)*/
    VOS_UINT16                          shwModeIndication:4;                    /*速率模式指示，0-8*/
    VOS_UINT16                          shwSti:1;                               /*SID标志，0表示SID_FIRST，1表示SID_UPDATE*/
    VOS_UINT16                          shwSidData2:3;                          /*SID帧数据,共35比特(32+3)*/
    VOS_INT16                           shwReserved;                            /*  */
}AMRWB_ENCODED_SID_FRAME_STRU;

/*****************************************************************************
  7 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  9 全局变量声明
*****************************************************************************/
extern VOS_UINT16                       g_uhwAmrwbSidFirstFlag;                 /*一次通话中收到过SID_FIRST桢的标记*/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif /* end of amrwb_interface.h */
