
#ifndef __BSP_GIC_PM_H__
#define __BSP_GIC_PM_H__
/*****************************************************************************
* 函 数 名     : gic_suspend
*
* 功能描述  : 保存gic寄存器
*
* 输入参数  : 无
* 输出参数  : 无
*
* 返 回 值     : 无
*
* 修改记录  : 2013年7月3日   lixiaojie     
                          
*****************************************************************************/
void gic_suspend(void);
/*****************************************************************************
* 函 数 名     : gic_resume
*
* 功能描述  : 恢复gic寄存器
*
* 输入参数  : 无
* 输出参数  : 无
*
* 返 回 值     : 无
*
* 修改记录  : 2013年7月3日   lixiaojie     
                          
*****************************************************************************/
void gic_resume(void);
#endif
