/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : VOICE_api.h
  版 本 号   : 初稿
  作    者   : 谢明辉 58441
  生成日期   : 2011年5月10日
  最近修改   :
  功能描述   : VOICE_api.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年5月10日
    作    者   : 谢明辉 58441
    修改内容   : 创建文件

******************************************************************************/
#ifndef __VOICE_API_H__
#define __VOICE_API_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "codec_typedefine.h"
#include "ucom_config.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*****************************************************************************
 函 数 名  : VOICE_ApiGetMsgId
 功能描述  : 由EventType获取MsgId
*****************************************************************************/
#define VOICE_ApiGetMsgId(uwEventType)  ((uwEventType) & 0x0000FFFF)

/*****************************************************************************
 函 数 名  : VOICE_ApiGetSenderPid
 功能描述  : 由EventType获取SenderPid
*****************************************************************************/
#define VOICE_ApiGetSenderPid(uwEventType)  ((uwEventType) >> 16)


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  7 UNION定义
*****************************************************************************/

/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/

/*****************************************************************************
  9 全局变量声明
*****************************************************************************/

/*****************************************************************************
  10 函数声明
*****************************************************************************/
extern VOS_UINT32 VOICE_ApiFsmInit( VOS_VOID );
extern VOS_UINT32 VOICE_ApiRtFsmInit( VOS_VOID );
extern VOS_UINT32  VOICE_ApiIsIdle(VOS_VOID);
extern VOS_UINT32 VOICE_ApiFsmErr(VOS_UINT32 ulEventType, VOS_VOID *pMsg);
extern VOS_UINT32 VOICE_ApiRtFsmErr(VOS_UINT32 ulEventType, VOS_VOID *pMsg);
extern VOS_UINT32 VOICE_ApiGetCurState(VOS_VOID * pstOsaMsg);

/*****************************************************************************
 函 数 名  : VOICE_ApiInitPid
 功能描述  : PID_VOICE初始化函数，包括其状态机初始化
 输入参数  : enum VOS_INIT_PHASE_DEFINE enInitPhrase
 输出参数  : 无
 返 回 值  : VOS_UINT32
 调用函数  : VOICE_ApiFuncTableInit
 被调函数  : UCOM_NormalFidInit
*****************************************************************************/
extern VOS_UINT32 VOICE_ApiPidInit(enum VOS_INIT_PHASE_DEFINE eInitPhrase);
/*****************************************************************************
 函 数 名  : VOICE_ApiPidProc
 功能描述  : PID_VOICE消息处理函数，处理函数表为g_astVoiceMsgFuncTable
 输入参数  : MsgBlock *pstOsaMsg
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  :
 被调函数  : UCOM_NormalFidInit
*****************************************************************************/
extern VOS_VOID VOICE_ApiPidProc(MsgBlock *pstOsaMsg);
/*****************************************************************************
 函 数 名  : VOICE_ApiRtPidInit
 功能描述  : PID_VOICE_RT初始化函数,其中包括调用DRV接口进行各种中断处理函数的
             注册
 输入参数  : enum VOS_INIT_PHASE_DEFINE enInitPhrase
 输出参数  : 无
 返 回 值  : VOS_OK
 调用函数  : VOICECTRL_McInit/VOICE_ApiRtFuncTableInit
 被调函数  : UCOM_comm_RtFidInit
*****************************************************************************/
extern VOS_UINT32 VOICE_ApiRtPidInit(enum VOS_INIT_PHASE_DEFINE InitPhrase);

/*****************************************************************************
 函 数 名  : VOICE_ApiRtPidProc
 功能描述  : PID_VOICE_RT消息处理函数，处理函数表为g_astVoiceRtMsgFuncTable
 输入参数  : MsgBlock *pstOsaMsg    -- 语音软件实时消息
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  : FSM_Bsearch
 被调函数  : UCOM_RtFidInit
*****************************************************************************/
extern VOS_VOID VOICE_ApiRtPidProc(MsgBlock *pstOsaMsg);


#ifdef __cplusplus
#if __cplusplus
    }
#endif
#endif

#endif /* end of VOICE_api.h */
