

#ifndef __PMIC_HI6559_H__
#define __PMIC_HI6559_H__

#include <balongv7r2/types.h>
#include <bsp_pmu.h>

#define PMU_HI6559_POWER_KEY_MASK               (1<<5)   /* Bit 5 for Power key */
#define PMU_HI6559_USB_STATE_MASK               (1<<5)
#define PMU_HI6559_HRESET_STATE_MASK            (1<<1)
#define HI6559_OTMP_125_OFFSET                  0
#define HI6559_OTMP_150_OFFSET                  7
#define HI6559_VSYS_UNDER_2P5_OFFSET            2
#define HI6559_VSYS_UNDER_2P85_OFFSET           3
#define HI6559_VSYS_OVER_6P0_OFFSET             4
#define HI6559_POWER_KEY_4S_PRESS_OFFSET        5
#define HI6559_POWER_KEY_20MS_RELEASE_OFFSET    6
#define HI6559_POWER_KEY_20MS_PRESS_OFFSET      7

#define HI6559_VALUE_VALID  1
#define HI6559_VALUE_INVALID  0

/*函数声明*/
/*****************************************************************************
 函 数 名  : pmu_hi6559_init
 功能描述  : pmu hi6559模块初始化
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
*****************************************************************************/
void pmu_hi6559_init(void);

/*****************************************************************************
 函 数 名  : hi6559_power_key_state_get
 功能描述  : 获取power键是否按下
 输入参数  : void
 输出参数  : 无
 返 回 值  : power键是否按下：1:按下；0:未按下)
*****************************************************************************/
bool hi6559_power_key_state_get(void);

/*****************************************************************************
 函 数 名  : bsp_hi6559_usb_state_get
 功能描述  : 获取usb是否插拔状态
 输入参数  : void
 输出参数  : 无
 返 回 值  : usb插入或拔出(1:插入；0:拔出)
*****************************************************************************/
bool hi6559_usb_state_get(void);

/*****************************************************************************
 函 数 名  : hi6559_hreset_state_get
 功能描述  : 判断pmu是否为热启动
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu是热启动或冷启动(1:热启动；0:冷启动)
*****************************************************************************/
bool hi6559_hreset_state_get(void);

/*****************************************************************************
 函 数 名  : hi6559_hreset_state_clear
 功能描述  : 清除pmu是否为热启动标志
 输入参数  : void
 输出参数  : 无
 返 回 值  : 无
*****************************************************************************/
void hi6559_hreset_state_clear(void);

/*****************************************************************************
 函 数 名  : hi6559_ldo14_switch
 功能描述  : 开关ldo14电源
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : lcd模块调用
*****************************************************************************/
int hi6559_ldo14_switch(power_switch_e sw);
/*****************************************************************************
 函 数 名  : hi6559_ldo14_volt_set
 功能描述  : 设置ldo14电源电压
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : lcd模块调用
*****************************************************************************/
int hi6559_ldo14_volt_set(int voltage);
/*****************************************************************************
 函 数 名  : hi6559_ldo23_switch
 功能描述  : 开关ldo23电源
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : efuse模块调用
*****************************************************************************/
int hi6559_ldo23_switch(power_switch_e sw);
/*****************************************************************************
 函 数 名  : hi6559_ldo23_volt_set
 功能描述  : 设置ldo23电源电压
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : efuse模块调用
*****************************************************************************/
int hi6559_ldo23_volt_set(int voltage);

/*****************************************************************************
 函 数 名  : hi6559_version_get
 功能描述  : 获取pmu的版本号
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu版本号
*****************************************************************************/
u8  hi6559_version_get(void);

/*****************************************************************************
 函 数 名  : hi6559_get_boot_state
 功能描述  : 系统启动时检查pmu寄存器状态，确认是否是由pmu引起的重启
 输入参数  : void
 输出参数  : reset.log
 返 回 值  : pmu问题或ok
*****************************************************************************/
s32 hi6559_get_boot_state(void);

/*****************************************************************************
 函 数 名  : hi6559_set_by_nv
 功能描述  : 根据nv项设置进行默认设置
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu默认设置(主要指与产品形态相关的)
*****************************************************************************/
void hi6559_set_by_nv(void);

#endif
