

#ifndef __PMIC_HI6551_H__
#define __PMIC_HI6551_H__

#include <balongv7r2/types.h>
#include <bsp_pmu.h>

/**/
#define PMU_HI6551_POWER_KEY_MASK         (1<<5)   /* Bit 5 for Power key */
#define PMU_HI6551_USB_STATE_MASK            (1<<5)
#define PMU_HI6551_HRESET_STATE_MASK            (1<<1)
#define HI6551_OTMP_125_OFFSET                          0
#define HI6551_OTMP_150_OFFSET                          7
#define HI6551_VSYS_UNDER_2P5_OFFSET                    2
#define HI6551_VSYS_UNDER_2P7_OFFSET                            3
#define HI6551_VSYS_OVER_6P0_OFFSET                             4
#define HI6551_POWER_KEY_4S_PRESS_OFFSET                 5
#define HI6551_POWER_KEY_20MS_RELEASE_OFFSET          6
#define HI6551_POWER_KEY_20MS_PRESS_OFFSET              7

/*函数声明*/
/*****************************************************************************
 函 数 名  : pmu_hi6551_init
 功能描述  : pmu hi6551模块初始化
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
void pmu_hi6551_init(void);
/*****************************************************************************
 函 数 名  : hi6551_power_key_state_get
 功能描述  : 获取power键是否按下
 输入参数  : void
 输出参数  : 无
 返 回 值  : power键是否按下：1:按下；0:未按下)
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
bool hi6551_power_key_state_get(void);
/*****************************************************************************
 函 数 名  : bsp_hi6551_usb_state_get
 功能描述  : 获取usb是否插拔状态
 输入参数  : void
 输出参数  : 无
 返 回 值  : usb插入或拔出(1:插入；0:拔出)
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
bool hi6551_usb_state_get(void);
/*****************************************************************************
 函 数 名  : hi6551_hreset_state_get
 功能描述  : 判断pmu是否为热启动
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu是热启动或冷启动(1:热启动；0:冷启动)
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
bool hi6551_hreset_state_get(void);
/*****************************************************************************
 函 数 名  : hi6551_hreset_state_clear
 功能描述  : 清除pmu是否为热启动标志
 输入参数  : void
 输出参数  : 无
 返 回 值  : 无
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
void hi6551_hreset_state_clear(void);
/*****************************************************************************
 函 数 名  : hi6551_lvs4_switch
 功能描述  : 开关lvs04电源
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : lcd模块调用
*****************************************************************************/
int hi6551_lvs4_switch(power_switch_e sw);
/*****************************************************************************
 函 数 名  : hi6551_ldo14_switch
 功能描述  : 开关ldo14电源
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : lcd模块调用
*****************************************************************************/
int hi6551_ldo14_switch(power_switch_e sw);
/*****************************************************************************
 函 数 名  : hi6551_ldo14_volt_set
 功能描述  : 设置ldo14电源电压
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : lcd模块调用
*****************************************************************************/
int hi6551_ldo14_volt_set(int voltage);
/*****************************************************************************
 函 数 名  : hi6551_ldo23_switch
 功能描述  : 开关ldo23电源
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : efuse模块调用
*****************************************************************************/
int hi6551_ldo23_switch(power_switch_e sw);
/*****************************************************************************
 函 数 名  : hi6551_ldo23_volt_set
 功能描述  : 设置ldo23电源电压
 输入参数  : void
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  : efuse模块调用
*****************************************************************************/
int hi6551_ldo23_volt_set(int voltage);
/*****************************************************************************
 函 数 名  : hi6551_version_get
 功能描述  : 获取pmu的版本号
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu版本号
 调用函数  :
 被调函数  : HSO集成,MSP调用
*****************************************************************************/
u8  hi6551_version_get(void);
int hi6551_get_boot_state(void);
/*****************************************************************************
 函 数 名  : hi6551_set_by_nv
 功能描述  : 根据nv项设置进行默认设置
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu默认设置(主要指与产品形态相关的)
 调用函数  :
 被调函数  :
*****************************************************************************/
void hi6551_set_by_nv(void);
#endif