

#ifndef __PMIC_HI6451_H__
#define __PMIC_HI6451_H__

#include <balongv7r2/types.h>
#include <product_config.h>
#include <bsp_pmu.h>

#define PMU_HI6451_POWER_KEY_MASK         (1<<4)   /* Bit 4 for Power key */
#define PMU_HI6451_USB_STATE_MASK            (1<<2)
#define PMU_HI6451_HRESET_STATE_MASK            (1<<1)

/*波特率*/
#define SPI_BAUT_RATE 2000000
/*PMU ADD*/
#define ADDR_BIT_OFFSET 9
/*PMU CMD*/
#define CMD_BIT_OFFSET 8


/*函数声明*/
/*****************************************************************************
 函 数 名  : pmu_hi6451_init
 功能描述  : pmu hi6451模块初始化
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
void pmu_hi6451_init(void);
/*****************************************************************************
 函 数 名  : hi6451_power_key_state_get
 功能描述  : 获取power键是否按下
 输入参数  : void
 输出参数  : 无
 返 回 值  : power键是否按下：1:按下；0:未按下)
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
bool hi6451_power_key_state_get(void);
/*****************************************************************************
 函 数 名  : bsp_hi6451_usb_state_get
 功能描述  : 获取usb是否插拔状态
 输入参数  : void
 输出参数  : 无
 返 回 值  : usb插入或拔出(1:插入；0:拔出)
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
bool hi6451_usb_state_get(void);
/*****************************************************************************
 函 数 名  : hi6451_hreset_state_get
 功能描述  : 判断pmu是否为热启动
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu是热启动或冷启动(1:热启动；0:冷启动)
 调用函数  : fastboot中pmu模块适配层
 被调函数  :
*****************************************************************************/
bool hi6451_hreset_state_get(void);
/*****************************************************************************
 函 数 名  : hi6451_ldo14_switch
 功能描述  : 开启或关闭LDO14
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 操作成功或失败
 调用函数  :
 被调函数  : fastboot中lcd文件调用
*****************************************************************************/
void hi6451_ldo14_switch(power_switch_e sw);
/*****************************************************************************
 函 数 名  : hi6451_ldo14_volt_set
 功能描述  : 设置ldo14的电压
 输入参数  : int voltage：设置的电压值(只支持3/6/9/12/15/18/21/24uV)*
 输出参数  : 无
 返 回 值  : 操作成功或失败
 调用函数  :
 被调函数  : fastboot中lcd文件调用
*****************************************************************************/
int hi6451_ldo14_volt_set(int voltage);
/*****************************************************************************
 函 数 名  : hi6451_version_get
 功能描述  : 获取pmu的版本号
 输入参数  : void
 输出参数  : 无
 返 回 值  : pmu版本号
 调用函数  :
 被调函数  : HSO集成,MSP调用
*****************************************************************************/
u8  hi6451_version_get(void);
int hi6451_get_boot_state(void);
#endif